{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend with no logic implemented.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (design system, navbar, hero, etc.) to their source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON document containing one-line descriptions of each frontend source file, summarizing the purpose of every component, hook, and config file in the project.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH-based CSS custom properties for light and dark color themes including background, foreground, border, chart, and sidebar tokens.",
  "frontend/index.html": "Minimal HTML entry point for the Vite/React app, mounting the React root div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that assembles all page sections (Navbar, Hero, Positioning, Services, Process, About, IdealClients, Investment, FAQ, FinalCTA, Footer) each wrapped in anchor-ID sections.",
  "frontend/src/components/About.tsx": "Dark two-column section presenting the studio's boutique identity on the left and three numbered guiding principles (design, build, deliver) as bordered cards on the right.",
  "frontend/src/components/FAQ.tsx": "Light section rendering four FAQs using the shadcn Accordion component with single-item expansion, gold-hover triggers, and smooth open/close animation.",
  "frontend/src/components/FinalCTA.tsx": "Dark closing section with a large display headline, three clarity statements, a mailto CTA button, and email/location contact details.",
  "frontend/src/components/Footer.tsx": "Dark footer with a three-column grid (brand, services, quick links), smooth-scroll navigation buttons, a copyright bar with Privacy/Terms links, and a caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/Hero.tsx": "Hero section component displaying the main headline, value proposition bullets, and two CTA buttons ('Book a Strategy Call' and 'View Our Work') with smooth scroll navigation and a mockup image.",
  "frontend/src/components/IdealClients.tsx": "Section describing the target client types with a checklist and a qualifier card explaining the studio's positioning on pricing and fit.",
  "frontend/src/components/Investment.tsx": "Pricing section displaying a starting price of ₹1,50,000 with supporting copy and a CTA button that smooth-scrolls to the contact section.",
  "frontend/src/components/Navbar.tsx": "Fixed top navigation bar with smooth-scroll links, a 'Book a Strategy Call' CTA, scroll-based background transition, and a collapsible mobile menu.",
  "frontend/src/components/Positioning.tsx": "Dark-themed section articulating the studio's philosophy that websites must build trust, communicate authority, and convert, with impact statements and closing copy.",
  "frontend/src/components/Process.tsx": "Five-step process section rendered as a horizontal timeline on desktop and a vertical stepper on mobile, covering Discovery through Launch.",
  "frontend/src/components/Services.tsx": "Three-card services grid covering Custom Web Design, Performance-Ready Websites, and eCommerce Development, each with a headline, description, bullet features, and a CTA link.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) actors, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook for React, managing login/logout state, AuthClient creation, and identity persistence via a context provider component.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file for future backend query hooks; currently exports nothing as the site is a static marketing page.",
  "frontend/src/index.css": "Global stylesheet defining the Digitalamiro design system with Tailwind base/utilities, OKLCH-based CSS custom properties for light/dark themes, typography (Inter + Syne fonts), and reusable utility classes for buttons, sections, and accent colors.",
  "frontend/src/main.tsx": "React app entry point that mounts the app with React Query and Internet Identity providers wrapping the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH-based color tokens, display font sizes, box shadows, border radii, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state manifest describing the Digitalamiro marketing site's architecture, existing features, design system, and image requirements at schema version 3."
}